app/controllers/albums_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 6]]
---
  def show
	  @tracks = Track.where(album_id: @album.id)

INSERT INTO "albums" ("title", "release_com", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["release_com", "asdasds"], ["artist_id", 5], ["created_at", "2022-11-11 04:42:06.522325"], ["updated_at", "2022-11-11 04:42:06.522325"]]
---
  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save

UPDATE "albums" SET "release_day" = $1, "genre" = $2, "intro" = $3, "recommend" = $4, "updated_at" = $5 WHERE "albums"."id" = $6  [["release_day", "dasdasd"], ["genre", "asdasd"], ["intro", "asdasd"], ["recommend", 0], ["updated_at", "2022-11-11 04:53:54.401440"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]
---
  def destroy
    @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:id])