app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("intro", "debut_day", "birth_day", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["intro", "sdfsdfsdf"], ["debut_day", "2022-11-10 10:49:00"], ["birth_day", "2022-11-10 10:49:00"], ["created_at", "2022-11-10 10:49:45.056537"], ["updated_at", "2022-11-10 10:49:45.056537"]]

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "activity_type" = $1, "award_history" = $2, "updated_at" = $3 WHERE "artists"."id" = $4  [["activity_type", "솔로"], ["award_history", "제6회 한국대중음악상|네티즌이 뽑은 올해의 음악인 (여자 아티스트)제6회 한국대중음악상|네티즌이 뽑은 올해의 음악인 (팝)제5회 한국대중음악상|올해의 신인"], ["updated_at", "2022-11-25 12:48:42.539264"], ["id", 1]]

  def destroy
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]