app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("title", "recommend", "flac", "genre", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @track.update(track_params)
---
UPDATE "tracks" SET "track_play" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["track_play", "/workspace/melon_web/.git/track_list/oratel.mp3"], ["updated_at", "2022-11-13 05:01:45.218572"], ["id", 1]]

    def set_track
      @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]